#工作日志
## 2019-3-24
## 方案更新
  需要进一步了解低功耗广域网
  考虑改wifi为使用如LoRa协议的广域网通信模块(SX1278等)
  
## 2019-3-23
## 知识学习
  nodemcu例程参考 https://post.smzdm.com/p/540069/
  大概了解使用nodemcu进行数据获取与通信的流程
## 方案更新
  为减少学习成本，后端语言暂定为python，数据库暂定mysql
  
## 2019-3-22-lzt
### 功能实现
  实现了增加了校验的数据显示
### 问题描述
  传感器摆放的方式会影响校验的成功与否；一种猜测是摆放方式不同影响了某些排线的位置，互相形成干扰？

## 2019-3-18-lzt

### 知识学习
  Python小项目四：实现简单的web服务器 https://blog.csdn.net/u010103202/article/details/74002538
### 方案更新
#### 近期至中长期目标规划
 - 近期目标：综合因素选择一个合适的后端语言，以及数据库；封装传感器操作
 - 中近期目标：完成服务器与数据库的搭建
 - 中期目标：完成传感器与服务器的通信，网页的简单数据显示
 - 中长期：优化网站布局 服务器，实现多设备通信
